oxygen0827/ESP32-C6-AMOLED-2.16/03_Clara_C6/sdkconfig.defaults
# C6 Clara application defaults.  Device-specific Wi-Fi/API values live in
# sdkconfig.local, which is intentionally kept outside source control.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_COLORS=y
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_MBEDTLS_ECP_RESTARTABLE=y
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y

# TLS certificate bundle for HTTPS/WSS production endpoints.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Private values are supplied by sdkconfig.local at build time.
CONFIG_CLARA_WIFI_SSID=""
CONFIG_CLARA_WIFI_PASSWORD=""
CONFIG_CLARA_API_BASE_URL=""
CONFIG_CLARA_TOPIC=""
CONFIG_CLARA_VAD_THRESHOLD=500
CONFIG_CLARA_VAD_MIN_MS=600
CONFIG_CLARA_VAD_SILENCE_MS=1200
